Revit 2027 API
BRepBuilder.IsPermittedSurfaceType Method
 A validator function that checks whether the surface object is of type supported as face surface by BRepBuilder.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsPermittedSurfaceType(
	Surface surface
)
Public Shared Function IsPermittedSurfaceType (
	surface As Surface
) As Boolean
public:
static bool IsPermittedSurfaceType(
	Surface^ surface
)
static member IsPermittedSurfaceType :
        surface : Surface -> bool
Parameters
surface Surface
 Surface object intended to be used as a face surface.
Return Value
Boolean
 True if a surface of this type may be used as a face surface, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 The allowed surface types are ConicalSurface, CylindricalSurface, Plane, RevolvedSurface, RuledSurface, and HermiteSurface.
See Also
Reference
BRepBuilder Class
Autodesk.Revit.DB Namespace